stories/notes/git.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " lang="en">
<head>
<meta charset="utf-8">
<meta name="description" content="Notes I've collected for doing things in git">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Git notes | Kyle M. Douglass</title>
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<link href="../../assets/css/ipython.min.css" rel="stylesheet" type="text/css">
<link href="../../assets/css/nikola_ipython.css" rel="stylesheet" type="text/css">
<meta content="#5670d4" name="theme-color">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../rss.xml">
<link rel="canonical" href="http://kmdouglass.github.io/stories/notes/git.html">
<!--[if lt IE 9]><![endif]--><meta name="description" itemprop="description" content="Notes I've collected for doing things in git">
<meta name="author" content="Kyle M. Douglass">
<meta property="og:site_name" content="Kyle M. Douglass">
<meta property="og:title" content="Git notes">
<meta property="og:url" content="http://kmdouglass.github.io/stories/notes/git.html">
<meta property="og:description" content="Notes I've collected for doing things in git">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2014-12-26T00:00:00+01:00">
<meta property="article:tag" content="git">
</head>
<body>
<a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>

<!-- Menubar -->

<nav class="navbar navbar-default navbar-static-top"><div class="container">
<!-- This keeps the margins nice -->
        <div class="navbar-header">
            <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#bs-navbar" aria-controls="bs-navbar" aria-expanded="false">
            <span class="sr-only">Toggle navigation</span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            </button>
            <a class="navbar-brand" href="http://kmdouglass.github.io/">

                <span id="blog-title">Kyle M. Douglass</span>
            </a>
        </div>
<!-- /.navbar-header -->
        <div class="collapse navbar-collapse" id="bs-navbar" aria-expanded="false">
            <ul class="nav navbar-nav">
<li>
<a href="../about-me.html">About</a>
                </li>
<li>
<a href="../../posts/index.html">Blog</a>
                </li>
<li>
<a href="../../categories/index.html">Tags</a>
                </li>
<li>
<a href="../../archive.html">Archive</a>
                </li>
<li>
<a href="../notes-and-projects.html">Notes</a>
                </li>
<li>
<a href="../contact.html">Contact</a>

                
            </li>
</ul>
<ul class="nav navbar-nav navbar-right">
<li>
    <a href="git.org" id="sourcelink">Source</a>
    </li>

                
            </ul>
</div>
<!-- /.navbar-collapse -->
    </div>
<!-- /.container -->
</nav><!-- End of Menubar --><div class="container" id="content" role="main">
    <div class="body-content">
        <!--Body content-->
        <div class="row">
            
            
<article class="post-text storypage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="#" class="u-url">Git notes</a></h1>

        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="git.html#sec-1">1. Commonly used Git commands</a></li>
<li>
<a href="git.html#sec-2">2. Common working tips</a>
<ul>
<li><a href="git.html#sec-2-1">2.1. Create a .gitignore file</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">
<span class="section-number-2">1</span> Commonly used Git commands</h2>
<div class="outline-text-2" id="text-1">
<dl class="org-dl">
<dt> git add &lt;file&gt; </dt>
<dd>Add a file to the staging area
</dd>
<dt> git checkout -b &lt;branch name&gt; </dt>
<dd>Creates a new branch and switches to it.
</dd>
<dt> git commit -m &lt;message&gt; </dt>
<dd>Commits the files in the staging area to the repository
</dd>
<dt> git commit –amend </dt>
<dd>Simply replaces the last commit with a new
one, including files in the staging area with the latest
commit. This is useful if files were missing from the previous
commit.
</dd>
<dt> git commit –amend -C HEAD </dt>
<dd>Adds a file to the most recent commit
</dd>
<dt> git commit –amend -m &lt;new message&gt; </dt>
<dd>Fixes the message of the last commit.
</dd>
<dt> git config –list </dt>
<dd>Lists parameters from the current
configuration, such as the user name, e-mail address, and
default text editor.
</dd>
<dt> git diff </dt>
<dd>Show all differences between <b>unstaged</b> files and
files in the working directory.
</dd>
<dt> git diff –staged </dt>
<dd>Show all differences between <b>staged</b> files
and the current working directory.
</dd>
<dt> git fetch &lt;remote name&gt; </dt>
<dd>Get all data that you don't yet have
from a remote repository. Merges must be manually
performed. (Use <b>git pull</b> to automatically merge data from a
repo with your working directory.)
</dd>
<dt> git log </dt>
<dd>Show the commit history of the project. Best used with
options like <i>-p</i>, <i>–stat</i> or <i>pretty=oneline</i>.
</dd>
<dt> git merge &lt;branch name&gt; </dt>
<dd>Merge the branch &lt;branch name&gt; into the
current working branch. Any conflicts will be highlighted in
the conflicted files for you to fix.
</dd>
<dt> git push origin master </dt>
<dd>Pushes the repository to the repository
referenced by <i>origin</i> to the <i>master</i> branch.
</dd>
<dt> git status </dt>
<dd>Lists tracked and untracked files, if they've been
changed since the last commit, etc.
</dd>
<dt> git remote -v </dt>
<dd>View the current remotes and their names.
</dd>
<dt> git remote set-url origin &lt;url&gt; </dt>
<dd>Sets the URL or a remote.
</dd>
<dt> git reset –hard HEAD~1; git push -f </dt>
<dd>Resets a bad commit to the previous one after a push.
</dd>
</dl>
<hr>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">
<span class="section-number-2">2</span> Common working tips</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">
<span class="section-number-3">2.1</span> Create a .gitignore file</h3>
<div class="outline-text-3" id="text-2-1">
<p>
<i>Sources</i>
</p>
<ol class="org-ol">
<li>
<a href="http://git-scm.com/book/en/Git-Basics-Recording-Changes-to-the-Repository">http://git-scm.com/book/en/Git-Basics-Recording-Changes-to-the-Repository</a>
</li>
</ol>
<p>
Git can automatically ignore files that follow certain specified
patterns. To do this, create a file called <i>.gitignore</i> inside the
working directory. Inside this file, add the patterns you want Git
to not even bother looking at.
</p>

<p>
For example, I can ignore the Emacs backup files that end in a
tilde by simplying adding
</p>

<div class="highlight"><pre>*~
</pre></div>

<p>
to the file. Now, files ending in tilde won't even be listed as
untracked when running the <i>git status</i> command.
</p>
</div>
</div>
</div>
    </div>
    

</article>
</div>
        <!--End of body content-->

        <footer id="footer">
            Contents © 2016         <a href="mailto:kyle.douglass@epfl.ch">Kyle M. Douglass</a> - Powered by         <a href="http://getnikola.com" rel="nofollow">Nikola</a>         
            
        </footer>
</div>
</div>


            <script src="../../assets/js/all-nocdn.js"></script><script>$('a.image-reference:not(.islink) img:not(.islink)').parent().colorbox({rel:"gal",maxWidth:"100%",maxHeight:"100%",scalePhotos:true});</script><!-- fancy dates --><script>
    moment.locale("en");
    fancydates(0, "YYYY-MM-DD HH:mm");
    </script><!-- end fancy dates -->
</body>
</html>
